---
kind: other
id: Properties.T:Autodesk.Revit.UI.UIView
source: html/1d8f36f7-fc37-e81a-9ece-b0996929b522.htm
---
# UIView Properties

Specifies whether the .NET object represents a valid Revit entity.